import React from 'react'
import './aboutInfo.css'


const AboutInfo = () => {
  return (
    <div className="aboutInfo">
        <div className ="container">
            <div className="preview">
                <img src="https://i.ibb.co/HPGjHnN/main-1-removebg-preview.png" alt="" />
                <h1>Ласкаво просимо до нашого коледжу</h1>
            </div>
            <div className="info">
                <p className ="AboutInfoP">
                    Відокремлений структурний підрозділ "Фаховий коледж Чернівецького національного університету імені Юрія Федьковича" є структурним підрозділом університету без статутсу юридичної особи і надає освітні послуги, пов'язані з одержанням фахової передвищої освіти за освітньо-професійним  ступенем "фаховий молодший бакалавр" з одночасним наданням повної загальної середньої освіти. 
                </p>
                <p className = "AboutInfoP2">
                    Говорячи про освіту загалом, хочеться згадати слова американського письменника і викладача Роберта Тору Кіосакі:<span> "Освіта, яка не вчить жити успішно в сучасному світі, не має  ніякої цінності. Кожен із нас приходить  у життя  з природженою здатністю жити щасливо й  успішно. А ми повинні збагатити цю здатність знаннями і навичками, які допомогли б нам реалізувати  її якомога ефективніше"</span>.
                </p>
            </div>
        </div>
    </div>
  )
}

export default AboutInfo