import React from "react";
import TextOverImage from "../../components/TextOverImage";
import MainText from "../../UI/Texts/MainText";
import AccentText from "../../UI/Texts/AccentText";

export default function HistoryPage(){
	return(
		<div className="h-full w-full flex-col">
			<div className='h-relativelyHeaderFullScreen w-full'>
					<TextOverImage src='./History.jpeg' alt='history'>
						<div className='text-slider absolute bottom-[20%] flex flex-col left-[10%]'>
							<span className='text-3xl w-fit font-normal mb-3 text-mainTextColor'>
								Дізнайся про нас більше
							</span>
							<h5 className="bg-accentTextColor text-mainTextColor p-2 text-4xl">Історія коледжу</h5>
						</div>
					</TextOverImage>
			</div>
			<div className="w-10/12 mx-auto flex flex-col mt-3">
				<MainText>
					<AccentText className="text-5xl font-bold">У</AccentText>
					2001 р. при Чернівецькому національному університеті імені Юрія Федьковича було створено природничо-економічне 
					відділення з підготовки молодших спеціалістів. Згідно з наказом Міністерства освіти і науки України від 18 липня 
					2002 р. № 413  його було реорганізовано в Коледж Чернівецького національного університету імені Юрія Федьковича, 
					як структурний підрозділ цього закладу вищої освіти без статусу юридичної особи.
				</MainText>
				<MainText>
					Першим директором коледжу було призначено кандидата філологічних наук Личук Марію Іванівну. Підготовка фахівців 
					спочатку здійснювалася за сімома спеціальностями: «Фінанси», «Бухгалтерський облік», «Економіка підприємства», «Організація 
					виробництва», «Прикладна екологія», «Прикладна математика», «Обслуговування комп'ютерних та інтелектуальних систем і мереж».
				</MainText>
				<MainText>
					Із серпня 2004 р. цей навчальний заклад очолює доцент кафедри математичного аналізу Собчук Олександр Васильович. 
					Олександр Васильович Собчук – випускник математичного факультету (1991), кандидат фізико-математичних наук,
					доцент. Народився 22 березня 1967 р. у м. Чернівцях. Після закінчення середньої школи у 1984 р. вступив 
					на математичний факультет Чернівецького університету, але навчання довелося перервати для проходження 
					строкової служби в лавах Радянської армії (1985-1987). Демобілізувавшись, повернувся до університету, 
					який закінчив з відзнакою. Відразу після здобуття вищої освіти почав працювати на рідному факультеті 
					викладачем-стажистом кафедри математичного аналізу, а з 1993 р. став асистентом цієї кафедри. У 1996 р. 
					успішно захистив кандидатську дисертацію «Берівська класифікація нарізно неперервних відображень і дискретні 
					обернені задачі» у Львівському національному університеті імені Івана Франка.
				</MainText>
				<div className="w-full h-full my-5">
					<img 
						src="./History-Univer.jpeg"
						alt="old-university"
						className="w-full object-cover"
					/>
				</div>
				<MainText>
					Згідно з наказом Міністерства освіти і науки України від 19 лютого 2016 р. №137  Буковинський державний фінансово-економічний 
					університет було реорганізовано шляхом приєднання до Чернівецького національного університету імені Юрія Федьковича. 
					Фінансово-економічний коледж Буковинського державного фінансово-економічного університету, який був його структурним 
					підрозділом, було реорганізовано шляхом приєднання до Коледжу Чернівецького національного університету імені Юрія Федьковича.
				</MainText>
				<MainText>
					Станом на 01 вересня 2019 р. у Коледжі Чернівецького національного університету імені Юрія Федьковича навчається понад тисячу
					студентів та працюють понад сто викладачів. Коледж Чернівецького національного університету імені Юрія Федьковича є найбільшим
					коледжем на теренах Чернівецької області.
				</MainText>
				<MainText>

				</MainText>
			</div>
			{/* <Story /> */}
		</div>
	)
}