import React from 'react';

export default function SpecialityPage() {
	return (
		<div className='w-full flex flex-col'>
			<div className='h-72 w-full relative'>
				<img
					className='w-full h-full object-cover'
					src='../applied-math.jpeg'
					alt=''
				/>
				<div className='absolute top-1/2 left-1/2 -translate-x-2/4 -translate-y-2/4'>
					<span className='bg-opacityBackgroundText w-3/6 text-4xl mt-8 text-mainTextColor font-medium p-2'>
						{' '}
						113 Прикладна математика
					</span>
				</div>
			</div>
			<div className='w-full flex'>
				<div className='w-4/5 mx-auto text-colorTextColor h-fit my-5'>
					<p className='text-xl font-normal indent-8 text-justify'>
						Майже всі, у кого є навики роботи на комп’ютері, люблять
						грати в комп’ютерні ігри. Але мало хто замислюється над
						тим, як досягається об’ємність зображення на екрані, за
						рахунок чого ми можемо розглядати предмет з усіх боків
						як у реальному житті, розгулювати по лабіринтах
						віртуального замку. Без математики все це було б
						неможливим.
					</p>
					<p className='text-xl font-normal indent-8 text-justify'>
						За допомогою прикладної математики ми можемо зробити
						видимими на екрані дисплея, наприклад, такі процеси, як
						розповсюдження електромагнітних хвиль у різних
						середовищах, роботу внутрішніх органів людини. Навіть
						прогноз погоди неможливо зробити без фахівців з
						прикладної математики. Саме освітньо-професійна програма{' '}
						<span className='text-accentTextColor font-medium'>
							{' '}
							"Прикладна математика"{' '}
						</span>{' '}
						спеціальності{' '}
						<span className='text-accentTextColor font-medium'>
							{' '}
							113 Прикладна математика
						</span>{' '}
						забезпечує інтегровану підготовку кадрів, які найбільш
						повно відповідають сучасному уявленню про вимоги, що
						висуваються до спеціалістів з інформаційних технологій.
					</p>
					<div className='w-full flex flex-col my-8'>
						<p className='text-center text-2xl mb-3'>
							Основні дисципліни, які складають фахову підготовку:
						</p>
						<div className='w-10/12 mx-auto flex justify-evenly'>
							<ul className='list-speciliaty text-colorTextColor font-medium'>
								<li>Об'єктно-орієнтовне програмування;</li>
								<li>Математичний аналіз</li>
								<li>
									Теорія ймовірності та математична статистика
								</li>
								<li>Чисельні методи</li>
								<li>Дискретна математика</li>
								<li>Диференціальні рівняння</li>
								<li>Рівняння математичної фізики</li>
								<li>
									Методи оптимізації та дослідження операцій
								</li>
								<li>Мова програмування С</li>
								<li>Програмне забезпечення</li>
								<li>Спеціалізовані мови програмування</li>
							</ul>
							<ul>
								<li>Об'єктно-орієнтовне програмування;</li>
								<li>Системне програмування;</li>
								<li>Комп'ютерна графіка;</li>
								<li>Бази даних;</li>
								<li>Операційні системи;</li>
								<li>
									Обчислювальні системи, мережі та комп'ютерні
									комунікації;
								</li>
								<li>Ресурси і сервіси мережі Internet;</li>
								<li>
									Моделювання еколого-економічних і соціальних
									процесів;
								</li>
								<li>Основи менеджменту та маркетингу;</li>
								<li>Основи економічних теорій.</li>
							</ul>
						</div>
					</div>
					<p className='text-xl font-normal indent-8 text-justify'>
						Випускник спеціальності{' '}
						<span className='text-accentTextColor font-medium'>
							{' '}
							113 Прикладна математика{' '}
						</span>{' '}
						підготовлений до діяльності, що вимагає поглибленої
						фундаментальної і професійної підготовки, у тому числі
						до науково-дослідної роботи в областях, що
						використовують методи прикладної математики і
						комп’ютерні технології; створення і використання
						математичних моделей процесів і об’єктів; розробки та
						застосування сучасних математичних методів та
						програмного забезпечення для вирішення завдань науки,
						техніки, економіки та управління; використання
						інформаційних технологій у проектно-конструкторської,
						управлінської та фінансової діяльності. Обґрунтованість
						і глибина підготовки в галузі прикладної математики
						дозволяє випускникам успішно займатися дослідженнями в
						різних областях математичного моделювання та
						інформаційних технологій для вдосконалення управління і
						підвищення ефективності бізнесу, дослідження та
						створення логістичних систем зв’язку.
					</p>
					<p className='text-xl font-normal indent-8 text-justify'>
						Отже, математика плюс комп’ютер – це і складає суть
						підготовки за освітньо-професійною програмою{' '}
						<span className='text-accentTextColor font-medium'>
							{' '}
							"Прикладна математика"{' '}
						</span>{' '}
						спеціальності{' '}
						<span className='text-accentTextColor font-medium'>
							{' '}
							113 Прикладна математика.
						</span>{' '}
						Вивчивши необхідні дисципліни, ви зможете застосувати
						свої знання і навики в будь-якій сфері людської
						діяльності.
					</p>
					<div className='w-10/12 mx-auto flex flex-col my-8'>
						<p className='h-2/6  text-2xl mb-3 text-center'>
							Професійні назви робіт, які здатний виконувати
							фахівець освітньо-професійного ступеня фаховий
							молодший бакалавр:
						</p>
						<div className='flex justify-start'>
							<ul className='list-speciliaty text-colorTextColor font-medium '>
								<li>
									Розробник математичного та програмного
									забезпечення ЕОМ;
								</li>
								<li>Технік-програміст;</li>
								<li>
									Керівник робочих груп фірм по розробці
									математичного та програмного забезпечення
									ЕОМ;
								</li>
								<li>
									Керівник відділу комп'ютерних технологій в
									корпоративних системах;
								</li>
								<li>Адміністратор бази даних.</li>
							</ul>
						</div>
					</div>
					<div className='w-10/12 mx-auto flex flex-col my-8'>
						<p className='h-/6 text-2xl mb-3 text-center'>
							Основні місця роботи, де можна працювати після
							закінчення навчання:
						</p>
						<div className='flex justify-start'>
							<ul className='list-speciliaty text-colorTextColor font-medium'>
								<li>Банківські установи;</li>
								<li>
									Відділ обробки інформації підприємств різних
									форм власності;
								</li>
								<li>
									Фірми, які займаються розробкою прикладного
									та програмного забезпечення;
								</li>
								<li>
									Фірми, що є провайдерами послуг Internet;
								</li>
								<li>
									Фірми, що надають послуги кабельного та
									супутникового телебачення;
								</li>
								<li>Наукові інститути і установи.</li>
							</ul>
						</div>
					</div>
				</div>
			</div>
		</div>
	);
}
