import React from 'react';
import { Link } from 'react-router-dom';
import './Story.css';

const Story = () => {
  return (
    <div className='history'>
        <div className='container'>
          <div className='history-block'>
            <div className='history-begining'>
              <h2>Заснування</h2>
              <p className='history-text'>У 2001 р. при Чернівецькому національному університеті імені Юрія Федьковича було створено природничо-економічне 
                  відділення з підготовки молодших спеціалістів. Згідно з наказом Міністерства освіти і науки України від 18 липня 
                  2002 р. № 413  його було реорганізовано в Коледж Чернівецького національного університету імені Юрія Федьковича, 
                  як структурний підрозділ цього закладу вищої освіти без статусу юридичної особи.</p>
              <p> Першим директором коледжу було призначено кандидата філологічних наук Личук Марію Іванівну. Підготовка фахівців 
                спочатку здійснювалася за сімома спеціальностями: «Фінанси», «Бухгалтерський облік», «Економіка підприємства», «Організація 
                виробництва», «Прикладна екологія», «Прикладна математика», «Обслуговування комп'ютерних та інтелектуальних систем і мереж».
              </p>
              <img src='https://i.ibb.co/G5Vpxjm/History.jpg' alt='' />
              <p>
                Згідно з наказом Міністерства освіти і науки України від 19 лютого 2016 р. №137  Буковинський державний фінансово-економічний 
                університет було реорганізовано шляхом приєднання до Чернівецького національного університету імені Юрія Федьковича. 
                Фінансово-економічний коледж Буковинського державного фінансово-економічного університету, який був його структурним 
                підрозділом, було реорганізовано шляхом приєднання до Коледжу Чернівецького національного університету імені Юрія Федьковича.
              </p>
              <p>
                Станом на 01 вересня 2019 р. у Коледжі Чернівецького національного університету імені Юрія Федьковича навчається понад тисячу
                студентів та працюють понад сто викладачів. Коледж Чернівецького національного університету імені Юрія Федьковича є найбільшим
                коледжем на теренах Чернівецької області.
              </p>
            </div>
            <p className='history-director'>
              Із серпня 2004 р. цей навчальний заклад очолює доцент кафедри математичного аналізу Собчук Олександр Васильович. Олександр 
              Васильович Собчук – випускник математичного факультету (1991), кандидат фізико-математичних наук, доцент. Народився 22 
              березня 1967 р. у м. Чернівцях. Після закінчення середньої школи у 1984 р. вступив на математичний факультет Чернівецького
              університету, але навчання довелося перервати для проходження строкової служби в лавах Радянської армії (1985-1987). 
              Демобілізувавшись, повернувся до університету, який закінчив з відзнакою. Відразу після здобуття вищої освіти почав працювати
              на рідному факультеті викладачем-стажистом кафедри математичного аналізу, а з 1993 р. став асистентом цієї кафедри. 
              У 1996 р. успішно захистив кандидатську дисертацію «Берівська класифікація нарізно неперервних відображень і дискретні 
              обернені задачі» у Львівському національному університеті імені Івана Франка.
            </p>
          </div>
        </div>
        <div className="history-faculty">
          <div className='history-faculty-container'>
            <div className="history-faculty-title">
              <h2>У коледжі створено і функціонує 3 відділення:</h2>
              <hr />
            </div>
            <div className='history-faculty-department'>
              <div className='department'>
                <img src="https://i.ibb.co/tpP0jHC/NATURAL.png" alt="" />
                <h2>Природниче</h2>
                <p className='button'><Link to ="/">Детальніше</Link></p>
              </div>
              <div className='department'>
                <img src='https://i.ibb.co/MkzX40y/EKONOM.png' alt='' />
                <h2>Економічне</h2>
                <p className='button'><Link to ="/">Детальніше</Link></p>
              </div>
              <div className='department'>
                <img src="https://i.ibb.co/h1LFsgS/PRAVO.png" alt="" />
                <h2>Юридичне</h2>
                <p className='button'><Link to ="/">Детальніше</Link></p>
              </div>
            </div>
          </div>
        </div>
        <div className='history-specialty'>
          <div className='container'>
            <h2>Підготовка здобувачів вищої освіти здійснюється за освітно-професійними програмами на 7-ми спеціальностях:</h2>
            <div className='specialty'>
              <ol>
                <li><i class="fas fa-dot-circle"></i> <p>071</p> “Облік і оподаткування”;</li>
                <li><i class="fas fa-dot-circle"></i> <p>072</p> “Фінанси, банківська справа та страхування”;</li>
                <li><i class="fas fa-dot-circle"></i> <p>076</p> “Підприємництво, торгівля та біржова діяльність”;</li>
                <li><i class="fas fa-dot-circle"></i> <p>081</p> “Право”;</li>
                <li><i class="fas fa-dot-circle"></i> <p>113</p> “Прикладна математика”;</li>
                <li><i class="fas fa-dot-circle"></i> <p>122</p> “Комп’ютерні науки ”;</li>
                <li><i class="fas fa-dot-circle"></i> <p>123</p> “Комп’ютерна інженерія”.</li>
              </ol>
              <img src="https://i.ibb.co/PMMShqX/chnu.jpg" alt="" />
            </div>
          </div>
        </div>
    </div>
  )
}

export default Story